In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from collections import Counter

In [3]:
data = pd.read_csv('movie_bd_v5.csv')
data.sample(5)

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year
1589,tt0346156,70000000,57958696,Sky Captain and the World of Tomorrow,Jude Law|Gwyneth Paltrow|Giovanni Ribisi|Angel...,Kerry Conran,Who will save us?,"When gigantic robots attack New York City, ""Sk...",107,Mystery|Action|Thriller|Science Fiction|Adventure,Paramount Pictures|Natural Nylon Entertainment...,9/17/2004,5.7,2004
1823,tt0181984,26000000,28780255,Boiler Room,Giovanni Ribisi|Vin Diesel|Nia Long|Tom Everet...,Ben Younger,Welcome to the new American dream.,A college dropout gets a job as a broker for a...,118,Crime|Drama|Thriller,New Line Cinema,2/18/2000,6.5,2000
1819,tt0195685,52000000,256271286,Erin Brockovich,Julia Roberts|Albert Finney|Aaron Eckhart|Marg...,Steven Soderbergh,She brought a small town to its feet and a hug...,A twice-divorced mother of three who sees an i...,131,Drama,Jersey Films,3/13/2000,6.9,2000
1261,tt1333125,6000000,32438988,Movie 43,Dennis Quaid|Greg Kinnear|Common|Charlie Saxto...,Steven Brill|Elizabeth Banks|Steve Carr|Rusty ...,The biggest cast ever assembled for the most o...,The film is composed of multiple comedy shorts...,90,Comedy,Greenestreet Films|Relativity Media|Virgin Pro...,1/1/2013,4.4,2013
908,tt0277296,60000000,165333180,The Scorpion King,Dwayne Johnson|Kelly Hu|Michael Clarke Duncan|...,Chuck Russell,Warrior. Legend. King.,"In ancient Egypt, peasant Mathayus is hired to...",92,Action|Fantasy|Adventure,Universal Pictures|Kalima Productions GmbH & C...,4/16/2002,5.2,2002

In [4]:
data.describe()

             budget       revenue      runtime  vote_average  release_year
count  1.889000e+03  1.889000e+03  1889.000000   1889.000000   1889.000000
mean   5.431083e+07  1.553653e+08   109.658549      6.140762   2007.860773
std    4.858721e+07  2.146698e+08    18.017041      0.764763      4.468841
min    5.000000e+06  2.033165e+06    63.000000      3.300000   2000.000000
25%    2.000000e+07  3.456058e+07    97.000000      5.600000   2004.000000
50%    3.800000e+07  8.361541e+07   107.000000      6.100000   2008.000000
75%    7.200000e+07  1.782626e+08   120.000000      6.600000   2012.000000
max    3.800000e+08  2.781506e+09   214.000000      8.100000   2015.000000

# Предобработка

In [4]:
answers = {} # создадим словарь для ответов

# тут другие ваши предобработки колонок например:

#the time given in the dataset is in string format.
#So we need to change this in datetime format
# ...
data['release_date'] = pd.to_datetime(data['release_date']) #changing time to datatime format
data['profit'] = data.revenue - data.budget #adding new column 'profit'
import itertools #importing itertools - normally should be together with all other imports

data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1889 entries, 0 to 1888
Data columns (total 15 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   imdb_id               1889 non-null   object
 1   budget                1889 non-null   int64
 2   revenue               1889 non-null   int64
 3   original_title        1889 non-null   object
 4   cast                  1889 non-null   object
 5   director              1889 non-null   object
 6   tagline               1889 non-null   object
 7   overview              1889 non-null   object
 8   runtime               1889 non-null   int64
 9   genres                1889 non-null   object
 10  production_companies  1889 non-null   object
 11  release_date          1889 non-null   datetime64[ns]
 12  vote_average          1889 non-null   float64
 13  release_year          1889 non-null   int64
 14  profit                1889 non-null   int64
dtypes: datetime64[ns](1), float64(1), int64(5), object(8)
memory usage: 221.5+ KB

# 1. У какого фильма из списка самый большой бюджет?

Использовать варианты ответов в коде решения запрещено.    
Вы думаете и в жизни у вас будут варианты ответов?)

In [55]:
# в словарь вставляем номер вопроса и ваш ответ на него
# Пример: 
#answers['1'] = '2. Spider-Man 3 (tt0413300)'
# запишите свой вариант ответа
answers['1'] = 'Pirates of the Caribbean: On Stranger Tides	tt1298650 +'
# если ответили верно, можете добавить комментарий со значком "+"

In [28]:
# тут пишем ваш код для решения данного вопроса:

#showing a row with two columns from dataframe: movie title and the maximum budet, used function .max()
data[['original_title', 'imdb_id']][data.budget == data.budget.max()]

                                  original_title    imdb_id
723  Pirates of the Caribbean: On Stranger Tides  tt1298650

ВАРИАНТ 2

In [29]:
# можно добавлять разные варианты решения
#sorting titles and budget columns by budget, the higher value on top. Selecting first 3 records from dataframe
data[['original_title','budget']].sort_values(by = 'budget', ascending = False).head(3)

                                   original_title     budget
723   Pirates of the Caribbean: On Stranger Tides  380000000
1669     Pirates of the Caribbean: At World's End  300000000
14                        Avengers: Age of Ultron  280000000

# 2. Какой из фильмов самый длительный (в минутах)?

In [56]:
# думаю логику работы с этим словарем вы уже поняли, 
# по этому не буду больше его дублировать
answers['2'] = 'Gods and Generals	tt0279111 +'

In [30]:
#selecting a row with movie title and its ID where runtime is maximum
data[['original_title', 'imdb_id','runtime']][data.runtime == data.runtime.max()]

         original_title    imdb_id  runtime
1157  Gods and Generals  tt0279111      214

# 3. Какой из фильмов самый короткий (в минутах)?

In [31]:
#selecting a row with movie title and its ID where runtime is minimum

data[['original_title', 'imdb_id','runtime']][data.runtime == data.runtime.min()]

      original_title    imdb_id  runtime
768  Winnie the Pooh  tt1449283       63

In [57]:
answers['3'] = 'Winnie the Pooh	tt1449283 +'

# 4. Какова средняя длительность фильмов?

In [32]:
#mean runtime value rounded to a full number
round(data.runtime.mean())

110

In [58]:
answers['4'] = '110 +'

# 5. Каково медианное значение длительности фильмов?

In [33]:
#median runtime value rounded to a full number

round(data.runtime.median())

107

In [59]:
answers['5'] = '107 +'

# 6. Какой самый прибыльный фильм?
#### Внимание! Здесь и далее под «прибылью» или «убытками» понимается разность между сборами и бюджетом фильма. (прибыль = сборы - бюджет) в нашем датасете это будет (profit = revenue - budget)

In [41]:
# лучше код получения столбца profit вынести в Предобработку что в начале
#profit column created above - counting maximum for profit column
data[['original_title', 'imdb_id','profit']][data.profit == data.profit.max()]

    original_title    imdb_id      profit
239         Avatar  tt0499549  2544505847

In [60]:
answers['6'] = 'Avatar	tt0499549+'

# 7. Какой фильм самый убыточный?

In [42]:
#counting minimum for profit column
data[['original_title', 'imdb_id','profit']][data.profit == data.profit.min()]

       original_title    imdb_id     profit
1245  The Lone Ranger  tt1210819 -165710090

In [61]:
answers['7'] = 'The Lone Ranger	tt1210819+'

# 8. У скольких фильмов из датасета объем сборов оказался выше бюджета?

In [47]:
#couting all the movies that had profit greater than zero
data[data['profit'] > 0].original_title.count()

1478

In [62]:
answers['8'] = '1478 +'

# 9. Какой фильм оказался самым кассовым в 2008 году?

In [48]:
#sorting profit in descending order for all the movies that were released in 2008, showing top 3
data[['original_title','profit']][(data.release_year == 2008)].sort_values(by = 'profit', ascending = False).head(3)

                                        original_title     profit
599                                    The Dark Knight  816921825
603  Indiana Jones and the Kingdom of the Crystal S...  601636033
607                                         Mamma Mia!  557841637

In [63]:
answers['9'] = 'The Dark Knight +'

# 10. Самый убыточный фильм за период с 2012 по 2014 г. (включительно)?

In [49]:
##sorting profit in ascending order for all the movies that were released between 2012 and 2014 (included), 
#showing top 3

data[['original_title','profit','release_year']][(data.release_year >= 2012) & (data.release_year <= 2014)].sort_values(
    by = 'profit').head(3)

       original_title     profit  release_year
1245  The Lone Ranger -165710090          2013
1214         R.I.P.D.  -68351500          2013
1007      Upside Down  -51893525          2012

In [64]:
answers['10'] = 'The Lone Ranger +'

# 11. Какого жанра фильмов больше всего?

In [5]:
# эту задачу тоже можно решать разными подходами, попробуй реализовать разные варианты
# если будешь добавлять функцию - выноси ее в предобработку что в начале
df = data.copy() #creating a copy of dataframe data
df.genres = df['genres'].str.split('|') #creating a list in column genres
expanded_df = df.explode('genres')#expanding the genres column so each genre have its own row
expanded_df.genres.value_counts() #counting each genre

Drama              782
Comedy             683
Thriller           596
Action             582
Adventure          415
Crime              315
Romance            308
Family             260
Science Fiction    248
Fantasy            222
Horror             176
Mystery            168
Animation          139
Music               64
History             62
War                 58
Western             19
Documentary          8
Foreign              2
Name: genres, dtype: int64

ВАРИАНТ 2

In [6]:
#counting how many times each genre has been mentioned in dataframe
pd.Series(data['genres'].str.cat(sep='|').split('|')).value_counts()

Drama              782
Comedy             683
Thriller           596
Action             582
Adventure          415
Crime              315
Romance            308
Family             260
Science Fiction    248
Fantasy            222
Horror             176
Mystery            168
Animation          139
Music               64
History             62
War                 58
Western             19
Documentary          8
Foreign              2
dtype: int64

In [65]:
answers['11'] = 'Drama +'

# 12. Фильмы какого жанра чаще всего становятся прибыльными?

In [7]:
#counting how many times each genre has profit higher than zero in dataframe, showing top position
pd.Series((data[data['profit'] > 0].genres.str.split('|').sum())).value_counts().index[0]

'Drama'

In [66]:
answers['12'] = 'Drama +'

# 13. У какого режиссера самые большие суммарные кассовые сборы?

In [94]:
df = data.copy()#copying original dataframe to df
df.director = df.director.str.split('|')#updating director column with director list without separator |
df = df.explode('director')#each director has its own row
df.groupby('director').profit.sum().sort_values(ascending = False).head(3)#grouping by director's name 
#and calculating the sum of all profits for the movie that each director filmed

director
Peter Jackson        5202593685
David Yates          3379295625
Christopher Nolan    3162548502
Name: profit, dtype: int64

In [67]:
answers['13'] = 'Peter Jackson +'

# 14. Какой режисер снял больше всего фильмов в стиле Action?

In [13]:
#selecting all movies that have "Action" as a genre and counting how many times each director filmed Action movie
pd.Series((data[data.genres.str.contains('Action')].director.str.split('|').sum())).value_counts().head()

Robert Rodriguez      9
Michael Bay           7
Paul W.S. Anderson    7
Antoine Fuqua         6
Ridley Scott          6
dtype: int64

In [68]:
answers['14'] = 'Robert Rodriguez +'

# 15. Фильмы с каким актером принесли самые высокие кассовые сборы в 2012 году?

In [6]:
df = data[data.release_year == 2012].copy()#copying original dataframe to df for only 2012 year
df.cast = df.cast.str.split('|')#updating cast column with cast list without separator |
e_df = df.explode('cast')#each actor has its own row
e_df[e_df.profit == e_df.profit.max()].cast.value_counts()#checking the cast of the movie with the highest profit for 2012

Chris Evans           1
Mark Ruffalo          1
Robert Downey Jr.     1
Chris Hemsworth       1
Scarlett Johansson    1
Name: cast, dtype: int64

In [69]:
answers['15'] = 'Chris Hemsworth +' #the selection of actors to choose from was: Nicolas Cage, Tom Hardy,
#Chris Hemsworth, Jim Sturgess and Emma Stone. Only Chris Hemsworth matched the selection

# 16. Какой актер снялся в большем количестве высокобюджетных фильмов?

In [6]:
#---------------Incorrect code, read the task wrongly, and used profit instead of budget-----------

df = data.copy() #copying original dataframe to df
df.cast = df.cast.str.split('|')#updating cast column with cast list without separator |
e_df = df.explode('cast')#each actor has its own row
e_df[e_df.profit > e_df.profit.median()].cast.value_counts().head()#couting how many times each actor played in 
#the movies with profit that is higher than median (also a mistake, should have been mean)

#---------end of incorrect code--------------

Cameron Diaz    18
Brad Pitt       17
Ben Stiller     17
Johnny Depp     17
Adam Sandler    16
Name: cast, dtype: int64

In [7]:
#--------------------correct code for number 16-------------------
df = data.copy()
df.cast = df.cast.str.split('|')
e_df = df.explode('cast')
e_df[e_df.budget > e_df.budget.mean()].cast.value_counts().head()

#realised that i used wrong column too late, the correct answer is Matt Damon

Matt Damon        18
Adam Sandler      17
Angelina Jolie    16
Eddie Murphy      15
Tom Cruise        15
Name: cast, dtype: int64

In [8]:
#Вариант 2 правильного решения
pd.Series((data[data.budget > data.budget.mean()]).cast.str.split('|').sum()).value_counts().head()

Matt Damon        18
Adam Sandler      17
Angelina Jolie    16
Eddie Murphy      15
Tom Cruise        15
dtype: int64

In [70]:
answers['16'] = 'Adam Sandler -' #the selection of actors to choose from was: Tom Cruise, Mark Wahlberg, 
#Matt Damon, Angelina Jolie and Adam Sandler. - Incorrect answer, used profit instead of budget: 
#Adam Sandler has higher score than the rest on the list

#The answer above is incorrect, unfortunately i missread the task and used Profit column instead of Budget.
#The correct answer is Matt Damon

# 17. В фильмах какого жанра больше всего снимался Nicolas Cage?

In [17]:
#got a number for each genre where Nicolas Cage took part, for both cast and genres used .split() method to make sure
#to go through all the cast and genres that were assigned to each movie
pd.Series((data[data.cast.str.contains('Nicolas Cage')].genres.str.split('|').sum())).value_counts().head()

Action      17
Thriller    15
Drama       12
Crime       10
Fantasy      8
dtype: int64

In [71]:
answers['17'] = 'Action + '

# 18. Самый убыточный фильм от Paramount Pictures

In [24]:
#dataframe with movie title and its profit, selected all movies that have profit less than zero and 
#production company was Paramount Pictures, sorted profit in ascending order
data[['original_title','profit']][(data.profit < 0) 
               &(data.production_companies.str.contains('Paramount Pictures'))].sort_values('profit').head()

            original_title    profit
925   K-19: The Widowmaker -64831034
1123              Timeline -60519261
1722                  Next -51788987
1623                 Alfie -46604061
1631               Twisted -24805000

In [74]:
answers['18'] = 'K-19: The Widowmaker +'

# 19. Какой год стал самым успешным по суммарным кассовым сборам?

In [25]:
#couting profit summ for each year in dataframe
data.groupby('release_year').profit.sum().sort_values(ascending = False).head()

release_year
2015    18668572378
2014    16397812953
2012    16077001687
2013    15243179791
2011    14730241341
Name: profit, dtype: int64

In [75]:
answers['19'] = '2015 +'

# 20. Какой самый прибыльный год для студии Warner Bros?

In [26]:
#checking if Warner Bros are in production_companies, and counting profit summ for each year
data[data.production_companies.str.contains('Warner Bros')].groupby('release_year').profit.sum().sort_values(ascending = False)

release_year
2014    2295464519
2007    2201675217
2008    2134595031
2010    1974712985
2011    1871393682
2003    1855493377
2009    1822454136
2013    1636453400
2004    1631933725
2005    1551980298
2001    1343545668
2012    1258020056
2002    1022709901
2015     870368348
2006     620170743
2000     452631386
Name: profit, dtype: int64

In [76]:
answers['20'] = '2014 +'

# 21. В каком месяце за все годы суммарно вышло больше всего фильмов?

In [27]:
data.release_date.dt.month.value_counts().head()#counting how many movies were released during each month of the dataset

9     227
12    190
10    186
8     161
3     156
Name: release_date, dtype: int64

In [77]:
answers['21'] = 'Сентябрь +'

# 22. Сколько суммарно вышло фильмов летом? (за июнь, июль, август)

In [28]:
#counting how many movies were released during the months 6-8 (summer months)
data[(data.release_date.dt.month >=6) & (data.release_date.dt.month <=8)].release_date.value_counts().sum()

450

In [78]:
answers['22'] = '450 +'

# 23. Для какого режиссера зима – самое продуктивное время года?

In [36]:
#defining what are the winter months, and splitting the directors list(removing separator |)
data[(data.release_date.dt.month ==12) | (data.release_date.dt.month ==1) 
     | (data.release_date.dt.month ==2) 
     & (data.director.str.split('|'))].director.value_counts().head()# counting how many movies were released
#by each director during winter moths (showing one top 5)

Peter Jackson        7
Clint Eastwood       6
Steven Soderbergh    6
Adam Shankman        4
Martin Scorsese      4
Name: director, dtype: int64

In [87]:
answers['23'] = 'Peter Jackson +'

# 24. Какая студия дает самые длинные названия своим фильмам по количеству символов?

In [46]:
df = data.copy()#copying original dataframe to df
df.production_companies = df.production_companies.str.split('|')# making a list of production_companies without separator |
e_df = df.explode('production_companies') #new dataframe with each production_companies having their own row
e_df['title_lenght'] = e_df.original_title.str.len()#new column with title symbol count
e_df.groupby('production_companies').title_lenght.max().sort_values(ascending = False).head(10)#counting maximum
#symbol count in original_title and grouping by production_companies

production_companies
Four By Two Productions                   83
Twentieth Century Fox Film Corporation    83
Walden Media                              62
Walt Disney                               62
Jim Henson Company, The                   59
21 Laps Entertainment                     59
Walt Disney Pictures                      59
Warner Bros.                              58
Plan B Entertainment                      58
Virtual Studios                           58
Name: title_lenght, dtype: int64

In [86]:
answers['24'] = 'Four By Two Productions + '

# 25. Описание фильмов какой студии в среднем самые длинные по количеству слов?

In [47]:
df = data.copy() #copying original dataframe to df
df.production_companies = df.production_companies.str.split('|')# making a list of production_companies without separator |
e_df = df.explode('production_companies')# new dataframe with each production_companies having their own row
e_df['overview_lenght'] = e_df.overview.str.split()#deviding overview into words,and writing new list into new column
e_df.overview_lenght = e_df.overview_lenght.str.len()#counting how many words are there in the list
e_df.groupby('production_companies').overview_lenght.max().sort_values(ascending = False).head(10)#counting maximum
#word count in overview and grouping by production_companies

production_companies
Lions Gate Films             175
Midnight Picture Show        175
GreeneStreet Films           175
Lakeshore Entertainment      175
Radical Studios              169
Flynn Picture Company        169
Paramount Pictures           169
Metro-Goldwyn-Mayer (MGM)    169
New Line Cinema              166
Fox Searchlight Pictures     161
Name: overview_lenght, dtype: int64

In [85]:
answers['25'] = 'Midnight Picture Show + '

# 26. Какие фильмы входят в 1 процент лучших по рейтингу? 
по vote_average

In [91]:
#dataframe with movie title and votes, sorted by vote_average, showing first 18 titles (there are 1889 movies all,
#used the following code to see the exact number: data.original_title.count()
#  1% from all movies are 1889//100 = 18)
data[['original_title','vote_average']].sort_values(by = 'vote_average', ascending = False).head(18)

                                     original_title  vote_average
599                                 The Dark Knight           8.1
118                                    Interstellar           8.0
125                              The Imitation Game           8.0
9                                        Inside Out           8.0
34                                             Room           8.0
1183                        The Wolf of Wall Street           7.9
128                                       Gone Girl           7.9
1191                               12 Years a Slave           7.9
119                         Guardians of the Galaxy           7.9
1081  The Lord of the Rings: The Return of the King           7.9
1800                                        Memento           7.9
370                                       Inception           7.9
872                                     The Pianist           7.9
138                        The Grand Budapest Hotel           7.9
1188                                            Her           7.8
28                                        Spotlight           7.8
124                                      Big Hero 6           7.8
177                          The Fault in Our Stars           7.8

In [84]:
answers['26'] = 'Inside Out, The Dark Knight, 12 Years a Slave + '

# 27. Какие актеры чаще всего снимаются в одном фильме вместе?

ВАРИАНТ 2

In [50]:
df = data.copy() # copying original dataframe
cast_pair = [] #creating empty list
for cast in df.cast.str.split('|'): #going through split cast list one by one actor
    cast_pair.extend(list(itertools.combinations(cast, 2))) #using itertools.combinations method to create actor 
                                                            # pairs (tuples) and adding them to list cast_pair

pd.Series(cast_pair).value_counts()#counting how many times each actor pair were filmed together

(Daniel Radcliffe, Emma Watson)              8
(Daniel Radcliffe, Rupert Grint)             8
(Rupert Grint, Emma Watson)                  7
(Johnny Depp, Helena Bonham Carter)          6
(Ben Stiller, Owen Wilson)                   6
                                            ..
(Leonardo DiCaprio, Joseph Gordon-Levitt)    1
(Ali Larter, Gabriel Macht)                  1
(Tom Cruise, Billy Crudup)                   1
(Jason Clarke, Toby Kebbell)                 1
(Bruce Payne, Adrian Paul)                   1
Length: 18121, dtype: int64

In [83]:
answers['27'] = 'Daniel Radcliffe, Rupert Grint + '

# Submission

In [89]:
# в конце можно посмотреть свои ответы к каждому вопросу
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides\ttt1298650 +',
 '2': 'Gods and Generals\ttt0279111 +',
 '3': 'Winnie the Pooh\ttt1449283 +',
 '4': '110 +',
 '5': '107 +',
 '6': 'Avatar\ttt0499549+',
 '7': 'The Lone Ranger\ttt1210819+',
 '8': '1478 +',
 '9': 'The Dark Knight +',
 '10': 'The Lone Ranger +',
 '11': 'Drama +',
 '12': 'Drama +',
 '13': 'Peter Jackson +',
 '14': 'Robert Rodriguez +',
 '15': 'Chris Hemsworth +',
 '16': 'Adam Sandler -',
 '17': 'Action + ',
 '18': 'K-19: The Widowmaker +',
 '19': '2015 +',
 '20': '2014 +',
 '21': 'Сентябрь +',
 '22': '450 +',
 '23': 'Peter Jackson +',
 '24': 'Four By Two Productions + ',
 '25': 'Midnight Picture Show + ',
 '26': 'Inside Out, The Dark Knight, 12 Years a Slave + ',
 '27': 'Daniel Radcliffe, Rupert Grint + '}

In [88]:
# и убедиться что ни чего не пропустил)
len(answers)

27